"""
Задача 34: Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм.
Поскольку разобраться в его кричалках не настолько просто, насколько легко он их придумывает,
Вам стоит написать программу.
Винни-Пух считает, что ритм есть, если число слогов (т.е. число гласных букв) в каждой фразе стихотворения одинаковое.
Фраза может состоять из одного слова, если во фразе несколько слов, то они разделяются дефисами.
Фразы отделяются друг от друга пробелами. Стихотворение Винни-Пух вбивает в программу с клавиатуры.
В ответе напишите “Парам пам-пам”, если с ритмом все в порядке и “Пам парам”, если с ритмом все не в порядке
Пример:
Ввод: пара-ра-рам рам-пам-папам па-ра-па-да
Вывод: Парам пам-пам
"""
""" def is_vowel(char):
    if char.lower() in 'ауоыиэяюёе':
        return 1 
    return 0 


syllables = []
poem_list = [word for word in input('Введите текст стихотворения: ').split()]
for word in poem_list:
    syllables.append(sum(map(is_vowel, word)))


if all (map(lambda x: x == syllables[0], syllables)):
    print('Парам пам-пам (с ритмом все в порядке)')
else:
    print('Пам парам (с ритмом не все в порядке)') """




""" ------------------------------------------------------------------------------------ """



"""
Задача 36: Напишите функцию print_operation_table(operation, num_rows=6, num_columns=6),
которая принимает в качестве аргумента функцию, вычисляющую элемент по номеру строки и столбца.
Аргументы num_rows и num_columns указывают число строк и столбцов таблицы, которые должны быть распечатаны.
Нумерация строк и столбцов идет с единицы (подумайте, почему не с нуля).
"""


""" def print_operation_table(operation, num_rows=6, num_columns=6):
    for col in range(num_columns + 1):
        print(str(col).ljust(3), end=' ')
    print()
    print('----' * (num_columns + 1))


    for i in range(1, num_rows + 1):
        print(f'{str(i).ljust(2)}|', end=' ')

        for j in range(1, num_columns + 1):
            print(str(operation(i, j)).ljust(3), end=' ')
        print()
    

print_operation_table(lambda x, y: x * y, 5, 5)
print()
print_operation_table(lambda x, y: x + y, 7, 7) """